---
kind: other
id: Properties.T:Autodesk.Revit.DB.ElementBinding
source: html/29984f28-40c3-a3ab-d85f-1387cd17fc86.htm
---
# ElementBinding Properties

Retrieve or set the categories to which a parameter definition will be bound.